'''
1. Введіть з клавіатури в масив п'ять цілочисельних значень. Виведіть їх в один рядок через кому. Отримайте для масиву середнє арифметичне.
'''

arr = [] #инициализация массива

mean = 0 #инициализация среднего арифметического

print('enter 5 values : ')

for i in range(5):
    el = int(input()) #ввод элемента
    arr.append(el) #добавление в массив
    mean += el; #суммирование элементов

print('\narr :', ', '.join(map(str, arr))) #вывод элементов массива через запятую
print('\nmean = ', mean / 5) #вывод среднего арифметического
