'''
10. Дані про температуру повітря за декаду листопада зберігаються в масиві. Визначити, скільки разів темпер атура опускалася нижче -10 градусів.
'''

import numpy as np #библиотека для использования функции случайных чисел

temp = np.random.randint(-15, 6, size = 10) #создание массива из 10 случайных чисел в диапазоне [-15; 5], которые соответствуют температуре в каждый день декады

print('temp:', temp)

count = 0 #переменная с количеством снижений температуры ниже -10

for i in range(10):
    if temp[i] < -10: #если температура ниже -10 - увеличиваем количество на 1
        count += 1

print('temp drops below -10', count, 'times')
