'''
16. Знайти добуток елементів масиву цілих чисел, які кратні 7. Розмірність
масиву 15. Заповнення масиву здійснити випадковими числами від 10 до 50.
'''

import numpy as np #библиотека для использования функции случайных чисел

arr = np.random.randint(10, 51, size = 15) #создание массива из 15 случайных чисел в диапазоне [10; 50]

print('arr:', arr)

mult = 1 #инициализация переменной для записи произведения

for i in range(15): #для всех элементов массива
    if arr[i] % 7 == 0: #если элемент делится на 7
        mult *= arr[i] #умножаем его на остальные 

print('multiplication of 7-divisible numbers = ', mult) #вывод произведения
