'''
2. Введіть з клавіатури п'ять цілочисельних елементів масиву X. Виведіть на екран значення кореня і квадрату кожного з елементів масиву.
'''

import math as m #библиотека для функции sqrt

X = [] #инициализация массива

print('enter 5 values : ')

for i in range(5):
    el = int(input()) #ввод элемента
    X.append(el) #добавление в массив

print('\nX :', X)

for i in range(5):
    print("\nsqrt of", X[i], "is", m.sqrt(X[i])) #вывод корня элемента
    print("sqr of", X[i], "is", X[i]**2) #вывод квадрата элемента
