'''
22. Знайти добуток елементів масиву, кратних 3 і 9. Розмірність масиву 10.
Заповнення масиву здійснити випадковими числами від 5 до 500.
'''

import numpy as np #библиотека для использования функции случайных чисел

arr = np.random.randint(5, 501, size = 10) #создание массива из 10 случайных чисел в диапазоне [5; 500]
print('arr:', arr)

mult = 1 #инициализация пемеренной для записи произведения

for i in range(10): #для всех элементов массива
    if arr[i] % 3 == 0 and arr[i] % 9 == 0: #если элемент кратен 3 и 9
        mult *= arr[i] #умножаем его на остальные

print('mult = ', mult) #вывод произведения

