'''
23. Знайти суму всіх елементів масиву цілих чисел, які менше середнього
арифметичного елементів масиву. Розмірність масиву 20. Заповнення масиву
здійснити випадковими числами від 150 до 300.
'''

import numpy as np #библиотека для использования функции случайных чисел

arr = np.random.randint(150, 301, size = 20) #создание массива из 20 случайных чисел в диапазоне [150; 300]
print('arr:', arr)

summ = 0 #инициализация пемеренной для записи суммы

mean = sum(arr) / 20 #среднее арифметическое массива

for i in range(10): #для всех элементов массива
    if arr[i] < mean: #если элемент < среднего арифметического
        summ += arr[i] #добавляем его

print('summ = ', summ) #вывод суммы
