'''
24. Знайти суму елементів масиву цілих чисел, які діляться на 5 і на 8
одночасно. Розмірність масиву 30. Заповнення масиву здійснити випадковими
числами від 500 до 1000.
'''

import numpy as np #библиотека для использования функции случайных чисел

arr = np.random.randint(500, 1001, size = 30) #создание массива из 30 случайных чисел в диапазоне [500; 1000]
print('arr:', arr)

summ = 0 #инициализация пемеренной для записи суммы

for i in range(30): #для всех элементов массива
    if arr[i] % 5 == 0 and arr[i] % 8 == 0: #если элемент делится на 5 и на 8
        summ += arr[i] #добавляем его

print('summ = ', summ) #вывод суммы
