'''
25. Знайти добуток елементів лінійного масиву цілих чисел, які кратні 5.
Розмірність масиву 10. Заповнення масиву здійснити випадковими числами від 10 до 100.
'''

import numpy as np #библиотека для использования функции случайных чисел

arr = np.random.randint(10, 101, size = 10) #создание массива из 10 случайных чисел в диапазоне [10; 100]
print('arr:', arr)

mult = 1 #инициализация пемеренной для записи произведения

for i in range(10): #для всех элементов массива
    if arr[i] % 5 == 0: #если элемент делится на 5
        mult *= arr[i] #добавляем его

print('mult = ', mult) #вывод произведения
