'''
26. Напишіть програму аналізу значень температури хворого за добу:
визначте мінімальне і максимальне значення, середнє арифметичне. Заміри
температури виробляються шість раз на добу і результати вводяться з клавіатури у масив T.
'''

T = [] #инициализация массива температур

print('enter temp :')

for i in range(6): #заполнение массива температурами
  T.append(float(input()))

print('\nmin temp =', min(T)) #минимальная
print('\nmax temp =', max(T)) #максимальная
print('\nmean temp =', sum(T) / 6) #средняя
