'''
27. Лінійний масив містить відомості про кількість опадів, що випали за
кожен з 12 місяців одного року. Складіть програму, що визначає загальну кількість опадів протягом цього року, середньомісячну кількість опадів, кількість посушливих місяців (коли кількість опадів було менше 30 мм), найпосушливіший місяць року.
'''

import numpy as np #библиотека для использования функции случайных чисел

precipitation = np.random.randint(10, 151, size = 12) #создание массива из 12 случайных чисел в диапазоне [10; 150], которые соответствуют миллиметрам осадков в каждый из месяцев

print('arr:', precipitation)

print('\ntotal precipitation :', sum(precipitation), 'mm') #всего осадков
print('\naverage precipitation :', sum(precipitation) / 12, 'mm') #в среднем за месяц

arids_count = 0 #число засушливых месяцев

for i in range(12): #для каждого месяца
    if precipitation[i] < 30: #если количество осадков < 30
        arids_count += 1 #считаем его засушливым

print('\ncount of arid months :', arids_count) #количество засушливых
print('\nmost arid month - ', np.where(precipitation == min(precipitation))[0] + 1) #самый засушливый
