'''
41. Змінній t привласнити значення істина, якщо максимальний елемент
одновимірного масиву єдиний і не перевищує наперед заданого числа а.
'''

import numpy as np

#функция, которая принимет на вход массив и число и возвращает истину или ложь, в зависимости от выполнения условия
def expr(list, num):
    t = False #результат = ложь
    if len((np.where(np.array(list) == max(np.array(list)))[0])) == 1 and max(list) <= num: #если максимальный элемент 1 и он <= числа
        t = True #результат = истина
    return t

arr = [1, 2, 3, 4]

num = 5

print(expr(arr, num))
