'''
46. Задана таблиця назв товарів, що випускаються заводом. Визначте, чи
повторюється в цій таблиці назва першого товару, і, якщо повторюється видаліть назву першого товару з таблиці.
'''

goods = ['a', 'b', 'c', 'd', 'b', 'a'] 

banned = goods[0] #определяем название первого товара

count = goods.count(banned) #и его количество

if count > 1: #если количество больше одного
    while count > 0: #пока этот товар в списке
        goods.remove(banned) #удаляем его
        count -= 1 #уменьшаем количество

print(goods)
