'''
48. Наведено список прізвищ брокерів товарної біржі з N чоловік. Поміняйте місцями прізвища брокерів: першого і останнього, другого і передостаннього, третього з початку і третього від кінця і т.д.
'''

import random

chars = 'abcdefghijklnopqrstuvwxyz' #алфавит для рандомайза фамилий

#функция которая принимает на вход количество фамилий, генерирует их, выводит список до и после решафла
def reshuffle(N):
    s_list = [] #список фамилий
    for i in range(N): #для всех фамилий
        surname = '' #начинаем с пустой строки
        for i in range(random.randint(5, 11)): #выбираем случайную длину
            surname += random.choice(chars) #и случайный символ
        s_list.append(surname) #добавляем фамилию в список
        print(surname) #выводим
    
    print('\n')

    for i in range(N): #для всех фамилий
        print(s_list[N - i - 1]) #выводим список с конца

reshuffle(10)
