'''
49. Задано дві таблиці. Одна містить найменування послуг, а інша розцінки за ці послуги. Видаліть з обох таблиць все, що передує послузі, ціна якої G гривень
'''

goods = ['a', 'b', 'c', 'd', 'e', 'f']
price = [ 1 ,  2 ,  3 ,  4 ,  5 ,  6 ]

G = int(input('enter G :')) #ввод и запись цены

i = 0 #индекс
while price[i] != G: #пока цена не равна G
    i += 1 #увеличиваем индекс

#срезаем элементы массивов, которые находятся перед ценой G и товаром, который соответствует этой цене
goods = goods[i::]
price = price[i::]
print(goods)
print(price)
