'''
53. В масиві X (1: n) кожен елемент рівний 0, 1 або 5. Переставити елементи масиву так, щоб спочатку розташовувалися всі нулі, потім все одиниці, а потім всі п'ятірки. Додаткового масиву не заводити.
'''

import random

#функция которая принимает на вход количество лементов массива, случайным образом заполняет его числами 0, 1, 5, выводит и сортирует
def set_and_sort(n):
    values = [0, 1, 5] #набор значений
    X = [0] * n #инициализация массива и заполнение нулями
    for i in range(n): #для всех элементов массива
        X[i] = random.choice(values) #записываем случаный из набора
    print(X) #выводим
    print(sorted(X)) #сортируем и выводим

set_and_sort(10)
