'''
58. Дан одновимі рний масив цілих чисел. Знайдіть, скільки разів в ньому повторюється найчастіше число.
'''

arr = [1, 2, 2, 3, 3, 3, 4, 4, 4, 4, 5, 5, 5, 5, 5]

times = [] #массив в который будет записано количество каждого элемента массива
for i in range(len(arr)): #для всех элементов
    times.append(arr.count(arr[i])) #добавляем сколько раз он встречается

print(max(times)) #находим и выводим максимум
