'''
59. Дан одновимірний масив з 10 цілих чисел. Підрахуйте кількість різних чисел в ньому.
'''

import numpy as np

arr = np.random.randint(1, 16, size = 10) #заполнение массива 10 числами от 1 до 15
print(arr)

print('\n', len(set(arr)), 'different numbers') #находим и выводим количество уникальных чисел

'''
60. Дан одновимірний масив з 10 цілих чисел. Підрахуйте найбільше число однакових чисел, що йдуть підряд в ньому.
'''
arr = [1, 1, 1, 2, 2, 2, 2, 3, 4, 5]

x = arr[0] #переменная для смены цифры начала ряда
count = 1 #начальная длина ряда
c = [] #массив для записи длин всех рядов в массиве

for i in range(1, 10):
    if arr[i] == x: #если следующий равен предыдущему
        count += 1 #увеличиваем длину ряда
    else:
        x = arr[i] #если ряд закончился - устанавливаем новую цифру начал
        c.append(count) #длину прошлого ряда добавляем в массив
        count = 1 #считать тоже начинем с начала

print(max(c)) #находим и выводим максимальную длину
